# specify a directory to install
cask_args appdir: '/Applications'

# install packages
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"

brew "btop"
brew "eza"
brew "fastfetch"
brew "unbound"
brew "ffmpeg"
brew "python@3.11"
brew "fonttools"
brew "fzf"
brew "lf"
brew "lsd"
brew "mas"
brew "nano"
brew "stow"
brew "switchaudio-osx"
brew "thefuck"
brew "tldr"
brew "trash"
brew "wget"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"

cask "appcleaner"
cask "discord"
cask 'dropbox'
cask 'alfred'
cask "eagle"
cask "font-hack-nerd-font"
cask 'flux'
cask "google-drive"
cask "iina"
cask 'iterm2'
cask "jdownloader"
cask "karabiner-elements"
cask "keka"
cask "keyboard-maestro"
cask "maccy"
cask "manila"
cask "monitorcontrol"
cask "nextcloud"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"
cask "quicklook-pat"
cask "sf-symbols"
cask 'slack'
cask "tailscale"
cask "visual-studio-code"
cask "wezterm"
cask "wordservice"

vscode "akamud.vscode-theme-onedark"
vscode "BrandonKirbyson.vscode-animations"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.github-vscode-theme"
vscode "ibrahimfadel.yabai-syntax-highlighting"
vscode "mateocerquetella.obsidian-radiance-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "PKief.material-icon-theme"
vscode "ritwickdey.LiveServer"
